Revit 2026 API

# KeyBasedTreeEntryKey Property

---

The key of this entry.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Key { get; }
```
```vb
Public ReadOnly Property Key As String
	Get
```
```cpp
public:
property String^ Key {
	String^ get ();
}
```
```fsharp
member Key : string with get
```

#### Property Value

String

This value will be used to do retrieval, sort and comparison. This value should not be empty.

#### Reference

KeyBasedTreeEntry Class

Autodesk.Revit.DB Namespace